In [40]:
#matplot inline magic command
%matplotlib inline
#dependencies and setup
import matplotlib.pyplot as plt
import pandas as pd

In [41]:
city_data_to_load= "Resources/city_data.csv"
ride_data_to_load= "Resources/ride_data.csv"

In [42]:
city_data_df= pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [43]:
ride_data_df= pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city           date   fare       ride_id
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.739411e+12
1  South Michelleport   3/4/19 18:24  30.24  2.343912e+12
2  Port Samanthamouth   2/24/19 4:29  33.44  2.005066e+12
3          Rodneyfort  2/10/19 23:22  23.44  5.149245e+12
4          South Jack    3/6/19 4:28  34.58  3.908451e+12
5        South Latoya  3/11/19 12:26   9.52  1.994999e+12
6       New Paulville  2/27/19 11:17  43.25  7.932084e+11
7        Simpsonburgh   4/26/19 0:43  35.98  1.119539e+11
8     South Karenland    1/8/19 3:28  35.09  7.995623e+12
9       North Jasmine    3/9/19 6:26  42.81  5.327642e+12

In [44]:
#this is where we start to clean the data- look for nulls- incorrect info etc
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [45]:
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [46]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [47]:
#now we find the unique values 
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [48]:
#this allows us to get the SUM of each type 
sum(city_data_df["type"]=="Urban")

66

In [49]:
sum(city_data_df["type"]=="Rural")

18

In [50]:
sum(city_data_df["type"]=="Suburban")

36

In [51]:
#we clean the data for the other CSV
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [52]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [53]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id    float64
dtype: object

In [54]:
#time to merge the DF 
#new_df = pd.merge(leftdf, rightdf, on=["column_leftdf", "column_rightdf"])
pyber_data_df=pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])
pyber_data_df.head()

                 city           date   fare       ride_id  driver_count   type
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.739411e+12             5  Urban
1  South Michelleport   3/4/19 18:24  30.24  2.343912e+12            72  Urban
2  Port Samanthamouth   2/24/19 4:29  33.44  2.005066e+12            57  Urban
3          Rodneyfort  2/10/19 23:22  23.44  5.149245e+12            34  Urban
4          South Jack    3/6/19 4:28  34.58  3.908451e+12            46  Urban